UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32mpu_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32MPU_gpio_v1_0_Modes.xml*/

#if !defined(_STM32MPU_PINMUX_H_)
# define _STM32MPU_PINMUX_H_

#define CEC_FUNC                 0
#define DCMI_D0_FUNC             1
#define DCMI_D1_FUNC             2
#define DCMI_D10_FUNC            3
#define DCMI_D11_FUNC            4
#define DCMI_D12_FUNC            5
#define DCMI_D13_FUNC            6
#define DCMI_D2_FUNC             7
#define DCMI_D3_FUNC             8
#define DCMI_D4_FUNC             9
#define DCMI_D5_FUNC             10
#define DCMI_D6_FUNC             11
#define DCMI_D7_FUNC             12
#define DCMI_D8_FUNC             13
#define DCMI_D9_FUNC             14
#define DCMI_HSYNC_FUNC          15
#define DCMI_PIXCLK_FUNC         16
#define DCMI_VSYNC_FUNC          17
#define DEBUG_DBTRGI_FUNC        18
#define DEBUG_DBTRGO_FUNC        19
#define DEBUG_TRACECLK_FUNC      20
#define DEBUG_TRACED0_FUNC       21
#define DEBUG_TRACED1_FUNC       22
#define DEBUG_TRACED10_FUNC      23
#define DEBUG_TRACED11_FUNC      24
#define DEBUG_TRACED12_FUNC      25
#define DEBUG_TRACED13_FUNC      26
#define DEBUG_TRACED14_FUNC      27
#define DEBUG_TRACED15_FUNC      28
#define DEBUG_TRACED2_FUNC       29
#define DEBUG_TRACED3_FUNC       30
#define DEBUG_TRACED4_FUNC       31
#define DEBUG_TRACED5_FUNC       32
#define DEBUG_TRACED6_FUNC       33
#define DEBUG_TRACED7_FUNC       34
#define DEBUG_TRACED8_FUNC       35
#define DEBUG_TRACED9_FUNC       36
#define DFSDM1_CKIN0_FUNC        37
#define DFSDM1_CKIN1_FUNC        38
#define DFSDM1_CKIN2_FUNC        39
#define DFSDM1_CKIN3_FUNC        40
#define DFSDM1_CKIN4_FUNC        41
#define DFSDM1_CKIN5_FUNC        42
#define DFSDM1_CKIN6_FUNC        43
#define DFSDM1_CKIN7_FUNC        44
#define DFSDM1_CKOUT_FUNC        45
#define DFSDM1_DATIN0_FUNC       46
#define DFSDM1_DATIN1_FUNC       47
#define DFSDM1_DATIN2_FUNC       48
#define DFSDM1_DATIN3_FUNC       49
#define DFSDM1_DATIN4_FUNC       50
#define DFSDM1_DATIN5_FUNC       51
#define DFSDM1_DATIN6_FUNC       52
#define DFSDM1_DATIN7_FUNC       53
#define DSIHOST_TE_FUNC          54
#define ETH1_CLK_FUNC            55
#define ETH1_CLK125_FUNC         56
#define ETH1_COL_FUNC            57
#define ETH1_CRS_FUNC            58
#define ETH1_CRS_DV_FUNC         59
#define ETH1_GTX_CLK_FUNC        60
#define ETH1_MDC_FUNC            61
#define ETH1_MDIO_FUNC           62
#define ETH1_PHY_INTN_FUNC       63
#define ETH1_PPS_OUT_FUNC        64
#define ETH1_REF_CLK_FUNC        65
#define ETH1_RXD0_FUNC           66
#define ETH1_RXD1_FUNC           67
#define ETH1_RXD2_FUNC           68
#define ETH1_RXD3_FUNC           69
#define ETH1_RXD4_FUNC           70
#define ETH1_RXD5_FUNC           71
#define ETH1_RXD6_FUNC           72
#define ETH1_RXD7_FUNC           73
#define ETH1_RX_CLK_FUNC         74
#define ETH1_RX_CTL_FUNC         75
#define ETH1_RX_DV_FUNC          76
#define ETH1_RX_ER_FUNC          77
#define ETH1_TXD0_FUNC           78
#define ETH1_TXD1_FUNC           79
#define ETH1_TXD2_FUNC           80
#define ETH1_TXD3_FUNC           81
#define ETH1_TXD4_FUNC           82
#define ETH1_TXD5_FUNC           83
#define ETH1_TXD6_FUNC           84
#define ETH1_TXD7_FUNC           85
#define ETH1_TX_CLK_FUNC         86
#define ETH1_TX_CTL_FUNC         87
#define ETH1_TX_EN_FUNC          88
#define ETH1_TX_ER_FUNC          89
#define FDCAN1_RX_FUNC           90
#define FDCAN1_TX_FUNC           91
#define FDCAN2_RX_FUNC           92
#define FDCAN2_TX_FUNC           93
#define FMC_A0_FUNC              94
#define FMC_A1_FUNC              95
#define FMC_A10_FUNC             96
#define FMC_A11_FUNC             97
#define FMC_A12_FUNC             98
#define FMC_A13_FUNC             99
#define FMC_A14_FUNC             100
#define FMC_A15_FUNC             101
#define FMC_A16_FUNC             102
#define FMC_A17_FUNC             103
#define FMC_A18_FUNC             104
#define FMC_A19_FUNC             105
#define FMC_A2_FUNC              106
#define FMC_A20_FUNC             107
#define FMC_A21_FUNC             108
#define FMC_A22_FUNC             109
#define FMC_A23_FUNC             110
#define FMC_A24_FUNC             111
#define FMC_A25_FUNC             112
#define FMC_A3_FUNC              113
#define FMC_A4_FUNC              114
#define FMC_A5_FUNC              115
#define FMC_A6_FUNC              116
#define FMC_A7_FUNC              117
#define FMC_A8_FUNC              118
#define FMC_A9_FUNC              119
#define FMC_ALE_FUNC             120
#define FMC_CLE_FUNC             121
#define FMC_CLK_FUNC             122
#define FMC_D0_FUNC              123
#define FMC_D1_FUNC              124
#define FMC_D10_FUNC             125
#define FMC_D11_FUNC             126
#define FMC_D12_FUNC             127
#define FMC_D13_FUNC             128
#define FMC_D14_FUNC             129
#define FMC_D15_FUNC             130
#define FMC_D2_FUNC              131
#define FMC_D3_FUNC              132
#define FMC_D4_FUNC              133
#define FMC_D5_FUNC              134
#define FMC_D6_FUNC              135
#define FMC_D7_FUNC              136
#define FMC_D8_FUNC              137
#define FMC_D9_FUNC              138
#define FMC_DA0_FUNC             139
#define FMC_DA1_FUNC             140
#define FMC_DA10_FUNC            141
#define FMC_DA11_FUNC            142
#define FMC_DA12_FUNC            143
#define FMC_DA13_FUNC            144
#define FMC_DA14_FUNC            145
#define FMC_DA15_FUNC            146
#define FMC_DA2_FUNC             147
#define FMC_DA3_FUNC             148
#define FMC_DA4_FUNC             149
#define FMC_DA5_FUNC             150
#define FMC_DA6_FUNC             151
#define FMC_DA7_FUNC             152
#define FMC_DA8_FUNC             153
#define FMC_DA9_FUNC             154
#define FMC_NBL0_FUNC            155
#define FMC_NBL1_FUNC            156
#define FMC_NCE_FUNC             157
#define FMC_NCE2_FUNC            158
#define FMC_NE1_FUNC             159
#define FMC_NE2_FUNC             160
#define FMC_NE3_FUNC             161
#define FMC_NE4_FUNC             162
#define FMC_NL_FUNC              163
#define FMC_NOE_FUNC             164
#define FMC_NWAIT_FUNC           165
#define FMC_NWE_FUNC             166
#define HDP_HDP0_FUNC            167
#define HDP_HDP1_FUNC            168
#define HDP_HDP2_FUNC            169
#define HDP_HDP3_FUNC            170
#define HDP_HDP4_FUNC            171
#define HDP_HDP5_FUNC            172
#define HDP_HDP6_FUNC            173
#define HDP_HDP7_FUNC            174
#define I2C1_SCL_FUNC            175
#define I2C1_SDA_FUNC            176
#define I2C1_SMBA_FUNC           177
#define I2C2_SCL_FUNC            178
#define I2C2_SDA_FUNC            179
#define I2C2_SMBA_FUNC           180
#define I2C3_SCL_FUNC            181
#define I2C3_SDA_FUNC            182
#define I2C3_SMBA_FUNC           183
#define I2C4_SCL_FUNC            184
#define I2C4_SDA_FUNC            185
#define I2C4_SMBA_FUNC           186
#define I2C5_SCL_FUNC            187
#define I2C5_SDA_FUNC            188
#define I2C5_SMBA_FUNC           189
#define I2C6_SCL_FUNC            190
#define I2C6_SDA_FUNC            191
#define I2C6_SMBA_FUNC           192
#define I2S1_CK_FUNC             193
#define I2S1_MCK_FUNC            194
#define I2S1_SDI_FUNC            195
#define I2S1_SDO_FUNC            196
#define I2S1_WS_FUNC             197
#define I2S2_CK_FUNC             198
#define I2S2_MCK_FUNC            199
#define I2S2_SDI_FUNC            200
#define I2S2_SDO_FUNC            201
#define I2S2_WS_FUNC             202
#define I2S3_CK_FUNC             203
#define I2S3_MCK_FUNC            204
#define I2S3_SDI_FUNC            205
#define I2S3_SDO_FUNC            206
#define I2S3_WS_FUNC             207
#define I2S_CKIN_FUNC            208
#define LPTIM1_ETR_FUNC          209
#define LPTIM1_IN1_FUNC          210
#define LPTIM1_IN2_FUNC          211
#define LPTIM1_OUT_FUNC          212
#define LPTIM2_ETR_FUNC          213
#define LPTIM2_IN1_FUNC          214
#define LPTIM2_IN2_FUNC          215
#define LPTIM2_OUT_FUNC          216
#define LPTIM3_OUT_FUNC          217
#define LPTIM4_OUT_FUNC          218
#define LPTIM5_OUT_FUNC          219
#define LTDC_B0_FUNC             220
#define LTDC_B1_FUNC             221
#define LTDC_B2_FUNC             222
#define LTDC_B3_FUNC             223
#define LTDC_B4_FUNC             224
#define LTDC_B5_FUNC             225
#define LTDC_B6_FUNC             226
#define LTDC_B7_FUNC             227
#define LTDC_CLK_FUNC            228
#define LTDC_DE_FUNC             229
#define LTDC_G0_FUNC             230
#define LTDC_G1_FUNC             231
#define LTDC_G2_FUNC             232
#define LTDC_G3_FUNC             233
#define LTDC_G4_FUNC             234
#define LTDC_G5_FUNC             235
#define LTDC_G6_FUNC             236
#define LTDC_G7_FUNC             237
#define LTDC_HSYNC_FUNC          238
#define LTDC_R0_FUNC             239
#define LTDC_R1_FUNC             240
#define LTDC_R2_FUNC             241
#define LTDC_R3_FUNC             242
#define LTDC_R4_FUNC             243
#define LTDC_R5_FUNC             244
#define LTDC_R6_FUNC             245
#define LTDC_R7_FUNC             246
#define LTDC_VSYNC_FUNC          247
#define MDIOS_MDC_FUNC           248
#define MDIOS_MDIO_FUNC          249
#define QUADSPI_BK1_IO0_FUNC     250
#define QUADSPI_BK1_IO1_FUNC     251
#define QUADSPI_BK1_IO2_FUNC     252
#define QUADSPI_BK1_IO3_FUNC     253
#define QUADSPI_BK1_NCS_FUNC     254
#define QUADSPI_BK2_IO0_FUNC     255
#define QUADSPI_BK2_IO1_FUNC     256
#define QUADSPI_BK2_IO2_FUNC     257
#define QUADSPI_BK2_IO3_FUNC     258
#define QUADSPI_BK2_NCS_FUNC     259
#define QUADSPI_CLK_FUNC         260
#define RCC_MCO_1_FUNC           261
#define RCC_MCO_2_FUNC           262
#define RTC_OUT2_FUNC            263
#define RTC_OUT_ALARM2_FUNC      264
#define RTC_OUT_CALIB2_FUNC      265
#define RTC_REFIN_FUNC           266
#define SAI1_CK1_FUNC            267
#define SAI1_CK2_FUNC            268
#define SAI1_D1_FUNC             269
#define SAI1_D2_FUNC             270
#define SAI1_D3_FUNC             271
#define SAI1_D4_FUNC             272
#define SAI1_FS_A_FUNC           273
#define SAI1_FS_B_FUNC           274
#define SAI1_MCLK_A_FUNC         275
#define SAI1_MCLK_B_FUNC         276
#define SAI1_SCK_A_FUNC          277
#define SAI1_SCK_B_FUNC          278
#define SAI1_SD_A_FUNC           279
#define SAI1_SD_B_FUNC           280
#define SAI2_FS_A_FUNC           281
#define SAI2_FS_B_FUNC           282
#define SAI2_MCLK_A_FUNC         283
#define SAI2_MCLK_B_FUNC         284
#define SAI2_SCK_A_FUNC          285
#define SAI2_SCK_B_FUNC          286
#define SAI2_SD_A_FUNC           287
#define SAI2_SD_B_FUNC           288
#define SAI3_FS_A_FUNC           289
#define SAI3_FS_B_FUNC           290
#define SAI3_MCLK_A_FUNC         291
#define SAI3_MCLK_B_FUNC         292
#define SAI3_SCK_A_FUNC          293
#define SAI3_SCK_B_FUNC          294
#define SAI3_SD_A_FUNC           295
#define SAI3_SD_B_FUNC           296
#define SAI4_CK1_FUNC            297
#define SAI4_CK2_FUNC            298
#define SAI4_D1_FUNC             299
#define SAI4_D2_FUNC             300
#define SAI4_D3_FUNC             301
#define SAI4_D4_FUNC             302
#define SAI4_FS_A_FUNC           303
#define SAI4_FS_B_FUNC           304
#define SAI4_MCLK_A_FUNC         305
#define SAI4_MCLK_B_FUNC         306
#define SAI4_SCK_A_FUNC          307
#define SAI4_SCK_B_FUNC          308
#define SAI4_SD_A_FUNC           309
#define SAI4_SD_B_FUNC           310
#define SDMMC1_CDIR_FUNC         311
#define SDMMC1_CK_FUNC           312
#define SDMMC1_CKIN_FUNC         313
#define SDMMC1_CMD_FUNC          314
#define SDMMC1_D0_FUNC           315
#define SDMMC1_D0DIR_FUNC        316
#define SDMMC1_D1_FUNC           317
#define SDMMC1_D123DIR_FUNC      318
#define SDMMC1_D2_FUNC           319
#define SDMMC1_D3_FUNC           320
#define SDMMC1_D4_FUNC           321
#define SDMMC1_D5_FUNC           322
#define SDMMC1_D6_FUNC           323
#define SDMMC1_D7_FUNC           324
#define SDMMC2_CDIR_FUNC         325
#define SDMMC2_CK_FUNC           326
#define SDMMC2_CKIN_FUNC         327
#define SDMMC2_CMD_FUNC          328
#define SDMMC2_D0_FUNC           329
#define SDMMC2_D0DIR_FUNC        330
#define SDMMC2_D1_FUNC           331
#define SDMMC2_D123DIR_FUNC      332
#define SDMMC2_D2_FUNC           333
#define SDMMC2_D3_FUNC           334
#define SDMMC2_D4_FUNC           335
#define SDMMC2_D5_FUNC           336
#define SDMMC2_D6_FUNC           337
#define SDMMC2_D7_FUNC           338
#define SDMMC3_CDIR_FUNC         339
#define SDMMC3_CK_FUNC           340
#define SDMMC3_CKIN_FUNC         341
#define SDMMC3_CMD_FUNC          342
#define SDMMC3_D0_FUNC           343
#define SDMMC3_D0DIR_FUNC        344
#define SDMMC3_D1_FUNC           345
#define SDMMC3_D123DIR_FUNC      346
#define SDMMC3_D2_FUNC           347
#define SDMMC3_D3_FUNC           348
#define SPDIFRX_IN0_FUNC         349
#define SPDIFRX_IN1_FUNC         350
#define SPDIFRX_IN2_FUNC         351
#define SPDIFRX_IN3_FUNC         352
#define SPI1_MISO_FUNC           353
#define SPI1_MOSI_FUNC           354
#define SPI1_NSS_FUNC            355
#define SPI1_SCK_FUNC            356
#define SPI2_MISO_FUNC           357
#define SPI2_MOSI_FUNC           358
#define SPI2_NSS_FUNC            359
#define SPI2_SCK_FUNC            360
#define SPI3_MISO_FUNC           361
#define SPI3_MOSI_FUNC           362
#define SPI3_NSS_FUNC            363
#define SPI3_SCK_FUNC            364
#define SPI4_MISO_FUNC           365
#define SPI4_MOSI_FUNC           366
#define SPI4_NSS_FUNC            367
#define SPI4_SCK_FUNC            368
#define SPI5_MISO_FUNC           369
#define SPI5_MOSI_FUNC           370
#define SPI5_NSS_FUNC            371
#define SPI5_SCK_FUNC            372
#define SPI6_MISO_FUNC           373
#define SPI6_MOSI_FUNC           374
#define SPI6_NSS_FUNC            375
#define SPI6_SCK_FUNC            376
#define TIM12_CH1_FUNC           377
#define TIM12_CH2_FUNC           378
#define TIM13_CH1_FUNC           379
#define TIM14_CH1_FUNC           380
#define TIM15_BKIN_FUNC          381
#define TIM15_CH1_FUNC           382
#define TIM15_CH1N_FUNC          383
#define TIM15_CH2_FUNC           384
#define TIM16_BKIN_FUNC          385
#define TIM16_CH1_FUNC           386
#define TIM16_CH1N_FUNC          387
#define TIM17_BKIN_FUNC          388
#define TIM17_CH1_FUNC           389
#define TIM17_CH1N_FUNC          390
#define TIM1_BKIN_FUNC           391
#define TIM1_BKIN2_FUNC          392
#define TIM1_CH1_FUNC            393
#define TIM1_CH1N_FUNC           394
#define TIM1_CH2_FUNC            395
#define TIM1_CH2N_FUNC           396
#define TIM1_CH3_FUNC            397
#define TIM1_CH3N_FUNC           398
#define TIM1_CH4_FUNC            399
#define TIM1_ETR_FUNC            400
#define TIM2_CH1_FUNC            401
#define TIM2_CH2_FUNC            402
#define TIM2_CH3_FUNC            403
#define TIM2_CH4_FUNC            404
#define TIM2_ETR_FUNC            405
#define TIM3_CH1_FUNC            406
#define TIM3_CH2_FUNC            407
#define TIM3_CH3_FUNC            408
#define TIM3_CH4_FUNC            409
#define TIM3_ETR_FUNC            410
#define TIM4_CH1_FUNC            411
#define TIM4_CH2_FUNC            412
#define TIM4_CH3_FUNC            413
#define TIM4_CH4_FUNC            414
#define TIM4_ETR_FUNC            415
#define TIM5_CH1_FUNC            416
#define TIM5_CH2_FUNC            417
#define TIM5_CH3_FUNC            418
#define TIM5_CH4_FUNC            419
#define TIM5_ETR_FUNC            420
#define TIM8_BKIN_FUNC           421
#define TIM8_BKIN2_FUNC          422
#define TIM8_CH1_FUNC            423
#define TIM8_CH1N_FUNC           424
#define TIM8_CH2_FUNC            425
#define TIM8_CH2N_FUNC           426
#define TIM8_CH3_FUNC            427
#define TIM8_CH3N_FUNC           428
#define TIM8_CH4_FUNC            429
#define TIM8_ETR_FUNC            430
#define UART4_CTS_FUNC           431
#define UART4_DE_FUNC            432
#define UART4_RTS_FUNC           433
#define UART4_RX_FUNC            434
#define UART4_TX_FUNC            435
#define UART5_CTS_FUNC           436
#define UART5_DE_FUNC            437
#define UART5_RTS_FUNC           438
#define UART5_RX_FUNC            439
#define UART5_TX_FUNC            440
#define UART7_CTS_FUNC           441
#define UART7_DE_FUNC            442
#define UART7_RTS_FUNC           443
#define UART7_RX_FUNC            444
#define UART7_TX_FUNC            445
#define UART8_CTS_FUNC           446
#define UART8_DE_FUNC            447
#define UART8_RTS_FUNC           448
#define UART8_RX_FUNC            449
#define UART8_TX_FUNC            450
#define USART1_CK_FUNC           451
#define UART1_CK_FUNC            451
#define USART1_CTS_FUNC          452
#define UART1_CTS_FUNC           452
#define USART1_DE_FUNC           453
#define UART1_DE_FUNC            453
#define USART1_NSS_FUNC          454
#define UART1_NSS_FUNC           454
#define USART1_RTS_FUNC          455
#define UART1_RTS_FUNC           455
#define USART1_RX_FUNC           456
#define UART1_RX_FUNC            456
#define USART1_TX_FUNC           457
#define UART1_TX_FUNC            457
#define USART2_CK_FUNC           458
#define UART2_CK_FUNC            458
#define USART2_CTS_FUNC          459
#define UART2_CTS_FUNC           459
#define USART2_DE_FUNC           460
#define UART2_DE_FUNC            460
#define USART2_NSS_FUNC          461
#define UART2_NSS_FUNC           461
#define USART2_RTS_FUNC          462
#define UART2_RTS_FUNC           462
#define USART2_RX_FUNC           463
#define UART2_RX_FUNC            463
#define USART2_TX_FUNC           464
#define UART2_TX_FUNC            464
#define USART3_CK_FUNC           465
#define UART3_CK_FUNC            465
#define USART3_CTS_FUNC          466
#define UART3_CTS_FUNC           466
#define USART3_DE_FUNC           467
#define UART3_DE_FUNC            467
#define USART3_NSS_FUNC          468
#define UART3_NSS_FUNC           468
#define USART3_RTS_FUNC          469
#define UART3_RTS_FUNC           469
#define USART3_RX_FUNC           470
#define UART3_RX_FUNC            470
#define USART3_TX_FUNC           471
#define UART3_TX_FUNC            471
#define USART6_CK_FUNC           472
#define UART6_CK_FUNC            472
#define USART6_CTS_FUNC          473
#define UART6_CTS_FUNC           473
#define USART6_DE_FUNC           474
#define UART6_DE_FUNC            474
#define USART6_NSS_FUNC          475
#define UART6_NSS_FUNC           475
#define USART6_RTS_FUNC          476
#define UART6_RTS_FUNC           476
#define USART6_RX_FUNC           477
#define UART6_RX_FUNC            477
#define USART6_TX_FUNC           478
#define UART6_TX_FUNC            478
#define USB_OTG_FS_SOF_FUNC      479
#define USB_OTG_HS_SOF_FUNC      480

