UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32mpu_pinmux.h
# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PA00) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PA00) && (func == TIM15_BKIN_FUNC          )) ?  4 : \
	((gpio == PA00) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PA00) && (func == USART2_NSS_FUNC          )) ?  7 : \
	((gpio == PA00) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PA00) && (func == SDMMC2_CMD_FUNC          )) ?  9 : \
	((gpio == PA00) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PA00) && (func == ETH1_CRS_FUNC            )) ? 11 : \
	((gpio == PA01) && (func == ETH1_CLK_FUNC            )) ?  0 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PA01) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PA01) && (func == LPTIM3_OUT_FUNC          )) ?  3 : \
	((gpio == PA01) && (func == TIM15_CH1N_FUNC          )) ?  4 : \
	((gpio == PA01) && (func == USART2_DE_FUNC           )) ?  7 : \
	((gpio == PA01) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PA01) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PA01) && (func == QUADSPI_BK1_IO3_FUNC     )) ?  9 : \
	((gpio == PA01) && (func == SAI2_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PA01) && (func == ETH1_REF_CLK_FUNC        )) ? 11 : \
	((gpio == PA01) && (func == ETH1_RX_CLK_FUNC         )) ? 11 : \
	((gpio == PA01) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PA02) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PA02) && (func == LPTIM4_OUT_FUNC          )) ?  3 : \
	((gpio == PA02) && (func == TIM15_CH1_FUNC           )) ?  4 : \
	((gpio == PA02) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PA02) && (func == SAI2_SCK_B_FUNC          )) ?  8 : \
	((gpio == PA02) && (func == SDMMC2_D0DIR_FUNC        )) ? 10 : \
	((gpio == PA02) && (func == ETH1_MDIO_FUNC           )) ? 11 : \
	((gpio == PA02) && (func == MDIOS_MDIO_FUNC          )) ? 12 : \
	((gpio == PA02) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PA03) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PA03) && (func == LPTIM5_OUT_FUNC          )) ?  3 : \
	((gpio == PA03) && (func == TIM15_CH2_FUNC           )) ?  4 : \
	((gpio == PA03) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PA03) && (func == LTDC_B2_FUNC             )) ?  9 : \
	((gpio == PA03) && (func == ETH1_COL_FUNC            )) ? 11 : \
	((gpio == PA03) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PA04) && (func == HDP_HDP0_FUNC            )) ?  0 : \
	((gpio == PA04) && (func == TIM5_ETR_FUNC            )) ?  2 : \
	((gpio == PA04) && (func == SAI4_D2_FUNC             )) ?  4 : \
	((gpio == PA04) && (func == I2S1_WS_FUNC             )) ?  5 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA04) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA04) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PA04) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PA04) && (func == SPI6_NSS_FUNC            )) ?  8 : \
	((gpio == PA04) && (func == SAI4_FS_A_FUNC           )) ? 12 : \
	((gpio == PA04) && (func == DCMI_HSYNC_FUNC          )) ? 13 : \
	((gpio == PA04) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PA05) && (func == SAI4_CK1_FUNC            )) ?  4 : \
	((gpio == PA05) && (func == I2S1_CK_FUNC             )) ?  5 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PA05) && (func == SPI6_SCK_FUNC            )) ?  8 : \
	((gpio == PA05) && (func == SAI4_MCLK_A_FUNC         )) ? 12 : \
	((gpio == PA05) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PA06) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PA06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PA06) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PA06) && (func == SAI4_CK2_FUNC            )) ?  4 : \
	((gpio == PA06) && (func == I2S1_SDI_FUNC            )) ?  5 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == SPI6_MISO_FUNC           )) ?  8 : \
	((gpio == PA06) && (func == TIM13_CH1_FUNC           )) ?  9 : \
	((gpio == PA06) && (func == MDIOS_MDC_FUNC           )) ? 11 : \
	((gpio == PA06) && (func == SAI4_SCK_A_FUNC          )) ? 12 : \
	((gpio == PA06) && (func == DCMI_PIXCLK_FUNC         )) ? 13 : \
	((gpio == PA06) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PA07) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PA07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PA07) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PA07) && (func == SAI4_D1_FUNC             )) ?  4 : \
	((gpio == PA07) && (func == I2S1_SDO_FUNC            )) ?  5 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == SPI6_MOSI_FUNC           )) ?  8 : \
	((gpio == PA07) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PA07) && (func == QUADSPI_CLK_FUNC         )) ? 10 : \
	((gpio == PA07) && (func == ETH1_CRS_DV_FUNC         )) ? 11 : \
	((gpio == PA07) && (func == ETH1_RX_CTL_FUNC         )) ? 11 : \
	((gpio == PA07) && (func == ETH1_RX_DV_FUNC          )) ? 11 : \
	((gpio == PA07) && (func == SAI4_SD_A_FUNC           )) ? 12 : \
	((gpio == PA08) && (func == RCC_MCO_1_FUNC           )) ?  0 : \
	((gpio == PA08) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PA08) && (func == TIM8_BKIN2_FUNC          )) ?  3 : \
	((gpio == PA08) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PA08) && (func == I2S3_SDO_FUNC            )) ?  5 : \
	((gpio == PA08) && (func == SPI3_MOSI_FUNC           )) ?  5 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == SDMMC2_CKIN_FUNC         )) ?  8 : \
	((gpio == PA08) && (func == SDMMC2_D4_FUNC           )) ?  9 : \
	((gpio == PA08) && (func == USB_OTG_FS_SOF_FUNC      )) ? 10 : \
	((gpio == PA08) && (func == USB_OTG_HS_SOF_FUNC      )) ? 10 : \
	((gpio == PA08) && (func == SAI4_SD_B_FUNC           )) ? 12 : \
	((gpio == PA08) && (func == UART7_RX_FUNC            )) ? 13 : \
	((gpio == PA08) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PA09) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PA09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PA09) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PA09) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PA09) && (func == SDMMC2_CDIR_FUNC         )) ?  8 : \
	((gpio == PA09) && (func == SDMMC2_D5_FUNC           )) ? 10 : \
	((gpio == PA09) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PA09) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PA10) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PA10) && (func == I2S3_WS_FUNC             )) ?  5 : \
	((gpio == PA10) && (func == SPI3_NSS_FUNC            )) ?  5 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PA10) && (func == MDIOS_MDIO_FUNC          )) ? 11 : \
	((gpio == PA10) && (func == SAI4_FS_B_FUNC           )) ? 12 : \
	((gpio == PA10) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PA10) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PA11) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PA11) && (func == I2C6_SCL_FUNC            )) ?  2 : \
	((gpio == PA11) && (func == I2C5_SCL_FUNC            )) ?  4 : \
	((gpio == PA11) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PA11) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PA11) && (func == UART4_RX_FUNC            )) ?  6 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == USART1_NSS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PA11) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PA12) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PA12) && (func == I2C6_SDA_FUNC            )) ?  2 : \
	((gpio == PA12) && (func == I2C5_SDA_FUNC            )) ?  4 : \
	((gpio == PA12) && (func == UART4_TX_FUNC            )) ?  6 : \
	((gpio == PA12) && (func == USART1_DE_FUNC           )) ?  7 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PA12) && (func == SAI2_FS_B_FUNC           )) ?  8 : \
	((gpio == PA12) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PA12) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PA13) && (func == DEBUG_DBTRGO_FUNC        )) ?  0 : \
	((gpio == PA13) && (func == DEBUG_DBTRGI_FUNC        )) ?  1 : \
	((gpio == PA13) && (func == RCC_MCO_1_FUNC           )) ?  2 : \
	((gpio == PA13) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PA14) && (func == DEBUG_DBTRGO_FUNC        )) ?  0 : \
	((gpio == PA14) && (func == DEBUG_DBTRGI_FUNC        )) ?  1 : \
	((gpio == PA14) && (func == RCC_MCO_2_FUNC           )) ?  2 : \
	((gpio == PA15) && (func == DEBUG_DBTRGI_FUNC        )) ?  0 : \
	((gpio == PA15) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA15) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA15) && (func == SAI4_D2_FUNC             )) ?  2 : \
	((gpio == PA15) && (func == SDMMC1_CDIR_FUNC         )) ?  3 : \
	((gpio == PA15) && (func == CEC_FUNC                 )) ?  4 : \
	((gpio == PA15) && (func == I2S1_WS_FUNC             )) ?  5 : \
	((gpio == PA15) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA15) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA15) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PA15) && (func == SPI6_NSS_FUNC            )) ?  7 : \
	((gpio == PA15) && (func == UART4_DE_FUNC            )) ?  8 : \
	((gpio == PA15) && (func == UART4_RTS_FUNC           )) ?  8 : \
	((gpio == PA15) && (func == SDMMC2_D5_FUNC           )) ?  9 : \
	((gpio == PA15) && (func == SDMMC2_CDIR_FUNC         )) ? 10 : \
	((gpio == PA15) && (func == SDMMC1_D5_FUNC           )) ? 11 : \
	((gpio == PA15) && (func == SAI4_FS_A_FUNC           )) ? 12 : \
	((gpio == PA15) && (func == UART7_TX_FUNC            )) ? 13 : \
	((gpio == PA15) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PB00) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB00) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PB00) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PB00) && (func == DFSDM1_CKOUT_FUNC        )) ?  6 : \
	((gpio == PB00) && (func == UART4_CTS_FUNC           )) ?  8 : \
	((gpio == PB00) && (func == LTDC_R3_FUNC             )) ?  9 : \
	((gpio == PB00) && (func == ETH1_RXD2_FUNC           )) ? 11 : \
	((gpio == PB00) && (func == MDIOS_MDIO_FUNC          )) ? 12 : \
	((gpio == PB00) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PB01) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB01) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PB01) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PB01) && (func == DFSDM1_DATIN1_FUNC       )) ?  6 : \
	((gpio == PB01) && (func == LTDC_R6_FUNC             )) ?  9 : \
	((gpio == PB01) && (func == ETH1_RXD3_FUNC           )) ? 11 : \
	((gpio == PB01) && (func == MDIOS_MDC_FUNC           )) ? 12 : \
	((gpio == PB01) && (func == LTDC_G0_FUNC             )) ? 14 : \
	((gpio == PB02) && (func == DEBUG_TRACED4_FUNC       )) ?  0 : \
	((gpio == PB02) && (func == RTC_OUT2_FUNC            )) ?  1 : \
	((gpio == PB02) && (func == RTC_OUT_ALARM2_FUNC      )) ?  1 : \
	((gpio == PB02) && (func == RTC_OUT_CALIB2_FUNC      )) ?  1 : \
	((gpio == PB02) && (func == SAI1_D1_FUNC             )) ?  2 : \
	((gpio == PB02) && (func == DFSDM1_CKIN1_FUNC        )) ?  3 : \
	((gpio == PB02) && (func == USART1_RX_FUNC           )) ?  4 : \
	((gpio == PB02) && (func == I2S_CKIN_FUNC            )) ?  5 : \
	((gpio == PB02) && (func == SAI1_SD_A_FUNC           )) ?  6 : \
	((gpio == PB02) && (func == I2S3_SDO_FUNC            )) ?  7 : \
	((gpio == PB02) && (func == SPI3_MOSI_FUNC           )) ?  7 : \
	((gpio == PB02) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PB02) && (func == QUADSPI_CLK_FUNC         )) ?  9 : \
	((gpio == PB03) && (func == DEBUG_TRACED9_FUNC       )) ?  0 : \
	((gpio == PB03) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PB03) && (func == SAI4_CK1_FUNC            )) ?  4 : \
	((gpio == PB03) && (func == I2S1_CK_FUNC             )) ?  5 : \
	((gpio == PB03) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PB03) && (func == I2S3_CK_FUNC             )) ?  6 : \
	((gpio == PB03) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PB03) && (func == SPI6_SCK_FUNC            )) ?  8 : \
	((gpio == PB03) && (func == SDMMC2_D2_FUNC           )) ?  9 : \
	((gpio == PB03) && (func == SAI4_MCLK_A_FUNC         )) ? 12 : \
	((gpio == PB03) && (func == UART7_RX_FUNC            )) ? 13 : \
	((gpio == PB04) && (func == DEBUG_TRACED8_FUNC       )) ?  0 : \
	((gpio == PB04) && (func == TIM16_BKIN_FUNC          )) ?  1 : \
	((gpio == PB04) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PB04) && (func == SAI4_CK2_FUNC            )) ?  4 : \
	((gpio == PB04) && (func == I2S1_SDI_FUNC            )) ?  5 : \
	((gpio == PB04) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PB04) && (func == I2S3_SDI_FUNC            )) ?  6 : \
	((gpio == PB04) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PB04) && (func == I2S2_WS_FUNC             )) ?  7 : \
	((gpio == PB04) && (func == SPI2_NSS_FUNC            )) ?  7 : \
	((gpio == PB04) && (func == SPI6_MISO_FUNC           )) ?  8 : \
	((gpio == PB04) && (func == SDMMC2_D3_FUNC           )) ?  9 : \
	((gpio == PB04) && (func == SAI4_SCK_A_FUNC          )) ? 12 : \
	((gpio == PB04) && (func == UART7_TX_FUNC            )) ? 13 : \
	((gpio == PB05) && (func == ETH1_CLK_FUNC            )) ?  0 : \
	((gpio == PB05) && (func == TIM17_BKIN_FUNC          )) ?  1 : \
	((gpio == PB05) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PB05) && (func == SAI4_D1_FUNC             )) ?  3 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PB05) && (func == I2S1_SDO_FUNC            )) ?  5 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PB05) && (func == I2C4_SMBA_FUNC           )) ?  6 : \
	((gpio == PB05) && (func == I2S3_SDO_FUNC            )) ?  7 : \
	((gpio == PB05) && (func == SPI3_MOSI_FUNC           )) ?  7 : \
	((gpio == PB05) && (func == SPI6_MOSI_FUNC           )) ?  8 : \
	((gpio == PB05) && (func == FDCAN2_RX_FUNC           )) ?  9 : \
	((gpio == PB05) && (func == SAI4_SD_A_FUNC           )) ? 10 : \
	((gpio == PB05) && (func == ETH1_PPS_OUT_FUNC        )) ? 11 : \
	((gpio == PB05) && (func == UART5_RX_FUNC            )) ? 12 : \
	((gpio == PB05) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PB05) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PB06) && (func == TIM16_CH1N_FUNC          )) ?  1 : \
	((gpio == PB06) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PB06) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB06) && (func == CEC_FUNC                 )) ?  5 : \
	((gpio == PB06) && (func == I2C4_SCL_FUNC            )) ?  6 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PB06) && (func == FDCAN2_TX_FUNC           )) ?  9 : \
	((gpio == PB06) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PB06) && (func == DFSDM1_DATIN5_FUNC       )) ? 11 : \
	((gpio == PB06) && (func == UART5_TX_FUNC            )) ? 12 : \
	((gpio == PB06) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PB07) && (func == TIM17_CH1N_FUNC          )) ?  1 : \
	((gpio == PB07) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB07) && (func == I2C4_SDA_FUNC            )) ?  6 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PB07) && (func == SDMMC2_D1_FUNC           )) ? 10 : \
	((gpio == PB07) && (func == DFSDM1_CKIN5_FUNC        )) ? 11 : \
	((gpio == PB07) && (func == FMC_NL_FUNC              )) ? 12 : \
	((gpio == PB07) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PB08) && (func == HDP_HDP6_FUNC            )) ?  0 : \
	((gpio == PB08) && (func == TIM16_CH1_FUNC           )) ?  1 : \
	((gpio == PB08) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PB08) && (func == DFSDM1_CKIN7_FUNC        )) ?  3 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB08) && (func == SDMMC1_CKIN_FUNC         )) ?  5 : \
	((gpio == PB08) && (func == I2C4_SCL_FUNC            )) ?  6 : \
	((gpio == PB08) && (func == SDMMC2_CKIN_FUNC         )) ?  7 : \
	((gpio == PB08) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PB08) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PB08) && (func == SDMMC2_D4_FUNC           )) ? 10 : \
	((gpio == PB08) && (func == ETH1_TXD3_FUNC           )) ? 11 : \
	((gpio == PB08) && (func == SDMMC1_D4_FUNC           )) ? 12 : \
	((gpio == PB08) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PB08) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PB09) && (func == HDP_HDP7_FUNC            )) ?  0 : \
	((gpio == PB09) && (func == TIM17_CH1_FUNC           )) ?  1 : \
	((gpio == PB09) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PB09) && (func == DFSDM1_DATIN7_FUNC       )) ?  3 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB09) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB09) && (func == I2C4_SDA_FUNC            )) ?  6 : \
	((gpio == PB09) && (func == SDMMC2_CDIR_FUNC         )) ?  7 : \
	((gpio == PB09) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PB09) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PB09) && (func == SDMMC2_D5_FUNC           )) ? 10 : \
	((gpio == PB09) && (func == SDMMC1_CDIR_FUNC         )) ? 11 : \
	((gpio == PB09) && (func == SDMMC1_D5_FUNC           )) ? 12 : \
	((gpio == PB09) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PB09) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PB10) && (func == LPTIM2_IN1_FUNC          )) ?  3 : \
	((gpio == PB10) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PB10) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB10) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == DFSDM1_DATIN7_FUNC       )) ?  6 : \
	((gpio == PB10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PB10) && (func == QUADSPI_BK1_NCS_FUNC     )) ?  9 : \
	((gpio == PB10) && (func == ETH1_RX_ER_FUNC          )) ? 11 : \
	((gpio == PB10) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PB11) && (func == LPTIM2_ETR_FUNC          )) ?  3 : \
	((gpio == PB11) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PB11) && (func == DFSDM1_CKIN7_FUNC        )) ?  6 : \
	((gpio == PB11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PB11) && (func == ETH1_TX_CTL_FUNC         )) ? 11 : \
	((gpio == PB11) && (func == ETH1_TX_EN_FUNC          )) ? 11 : \
	((gpio == PB11) && (func == DSIHOST_TE_FUNC          )) ? 13 : \
	((gpio == PB11) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PB12) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PB12) && (func == I2C6_SMBA_FUNC           )) ?  2 : \
	((gpio == PB12) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PB12) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB12) && (func == DFSDM1_DATIN1_FUNC       )) ?  6 : \
	((gpio == PB12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PB12) && (func == USART3_RX_FUNC           )) ?  8 : \
	((gpio == PB12) && (func == FDCAN2_RX_FUNC           )) ?  9 : \
	((gpio == PB12) && (func == ETH1_TXD0_FUNC           )) ? 11 : \
	((gpio == PB12) && (func == UART5_RX_FUNC            )) ? 14 : \
	((gpio == PB13) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PB13) && (func == DFSDM1_CKOUT_FUNC        )) ?  3 : \
	((gpio == PB13) && (func == LPTIM2_OUT_FUNC          )) ?  4 : \
	((gpio == PB13) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB13) && (func == DFSDM1_CKIN1_FUNC        )) ?  6 : \
	((gpio == PB13) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PB13) && (func == USART3_NSS_FUNC          )) ?  7 : \
	((gpio == PB13) && (func == FDCAN2_TX_FUNC           )) ?  9 : \
	((gpio == PB13) && (func == ETH1_TXD1_FUNC           )) ? 11 : \
	((gpio == PB13) && (func == UART5_TX_FUNC            )) ? 14 : \
	((gpio == PB14) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB14) && (func == TIM12_CH1_FUNC           )) ?  2 : \
	((gpio == PB14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PB14) && (func == USART1_TX_FUNC           )) ?  4 : \
	((gpio == PB14) && (func == I2S2_SDI_FUNC            )) ?  5 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PB14) && (func == DFSDM1_DATIN2_FUNC       )) ?  6 : \
	((gpio == PB14) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PB14) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PB14) && (func == SDMMC2_D0_FUNC           )) ?  9 : \
	((gpio == PB15) && (func == RTC_REFIN_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB15) && (func == TIM12_CH2_FUNC           )) ?  2 : \
	((gpio == PB15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PB15) && (func == USART1_RX_FUNC           )) ?  4 : \
	((gpio == PB15) && (func == I2S2_SDO_FUNC            )) ?  5 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PB15) && (func == DFSDM1_CKIN2_FUNC        )) ?  6 : \
	((gpio == PB15) && (func == SDMMC2_D1_FUNC           )) ?  9 : \
	((gpio == PC00) && (func == DFSDM1_CKIN0_FUNC        )) ?  3 : \
	((gpio == PC00) && (func == LPTIM2_IN2_FUNC          )) ?  4 : \
	((gpio == PC00) && (func == DFSDM1_DATIN4_FUNC       )) ?  6 : \
	((gpio == PC00) && (func == SAI2_FS_B_FUNC           )) ?  8 : \
	((gpio == PC00) && (func == QUADSPI_BK2_NCS_FUNC     )) ? 10 : \
	((gpio == PC00) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PC01) && (func == DEBUG_TRACED0_FUNC       )) ?  0 : \
	((gpio == PC01) && (func == SAI1_D1_FUNC             )) ?  2 : \
	((gpio == PC01) && (func == DFSDM1_DATIN0_FUNC       )) ?  3 : \
	((gpio == PC01) && (func == DFSDM1_CKIN4_FUNC        )) ?  4 : \
	((gpio == PC01) && (func == I2S2_SDO_FUNC            )) ?  5 : \
	((gpio == PC01) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PC01) && (func == SAI1_SD_A_FUNC           )) ?  6 : \
	((gpio == PC01) && (func == SDMMC2_CK_FUNC           )) ?  9 : \
	((gpio == PC01) && (func == ETH1_MDC_FUNC            )) ? 11 : \
