UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32mpu_pinmux.h
	((gpio == PC01) && (func == MDIOS_MDC_FUNC           )) ? 12 : \
	((gpio == PC02) && (func == DFSDM1_CKIN1_FUNC        )) ?  3 : \
	((gpio == PC02) && (func == I2S2_SDI_FUNC            )) ?  5 : \
	((gpio == PC02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PC02) && (func == DFSDM1_CKOUT_FUNC        )) ?  6 : \
	((gpio == PC02) && (func == ETH1_TXD2_FUNC           )) ? 11 : \
	((gpio == PC02) && (func == DCMI_PIXCLK_FUNC         )) ? 13 : \
	((gpio == PC03) && (func == DEBUG_TRACECLK_FUNC      )) ?  0 : \
	((gpio == PC03) && (func == DFSDM1_DATIN1_FUNC       )) ?  3 : \
	((gpio == PC03) && (func == I2S2_SDO_FUNC            )) ?  5 : \
	((gpio == PC03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PC03) && (func == ETH1_TX_CLK_FUNC         )) ? 11 : \
	((gpio == PC04) && (func == DFSDM1_CKIN2_FUNC        )) ?  3 : \
	((gpio == PC04) && (func == I2S1_MCK_FUNC            )) ?  5 : \
	((gpio == PC04) && (func == SPDIFRX_IN2_FUNC         )) ?  9 : \
	((gpio == PC04) && (func == ETH1_RXD0_FUNC           )) ? 11 : \
	((gpio == PC05) && (func == SAI1_D3_FUNC             )) ?  2 : \
	((gpio == PC05) && (func == DFSDM1_DATIN2_FUNC       )) ?  3 : \
	((gpio == PC05) && (func == SAI4_D4_FUNC             )) ?  4 : \
	((gpio == PC05) && (func == SAI1_D4_FUNC             )) ?  6 : \
	((gpio == PC05) && (func == SPDIFRX_IN3_FUNC         )) ?  9 : \
	((gpio == PC05) && (func == ETH1_RXD1_FUNC           )) ? 11 : \
	((gpio == PC05) && (func == SAI4_D3_FUNC             )) ? 12 : \
	((gpio == PC06) && (func == HDP_HDP1_FUNC            )) ?  0 : \
	((gpio == PC06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PC06) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PC06) && (func == DFSDM1_CKIN3_FUNC        )) ?  4 : \
	((gpio == PC06) && (func == I2S2_MCK_FUNC            )) ?  5 : \
	((gpio == PC06) && (func == USART6_TX_FUNC           )) ?  7 : \
	((gpio == PC06) && (func == SDMMC1_D0DIR_FUNC        )) ?  8 : \
	((gpio == PC06) && (func == SDMMC2_D0DIR_FUNC        )) ?  9 : \
	((gpio == PC06) && (func == SDMMC2_D6_FUNC           )) ? 10 : \
	((gpio == PC06) && (func == DSIHOST_TE_FUNC          )) ? 11 : \
	((gpio == PC06) && (func == SDMMC1_D6_FUNC           )) ? 12 : \
	((gpio == PC06) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PC06) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PC07) && (func == HDP_HDP4_FUNC            )) ?  0 : \
	((gpio == PC07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PC07) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PC07) && (func == DFSDM1_DATIN3_FUNC       )) ?  4 : \
	((gpio == PC07) && (func == I2S3_MCK_FUNC            )) ?  6 : \
	((gpio == PC07) && (func == USART6_RX_FUNC           )) ?  7 : \
	((gpio == PC07) && (func == SDMMC1_D123DIR_FUNC      )) ?  8 : \
	((gpio == PC07) && (func == SDMMC2_D123DIR_FUNC      )) ?  9 : \
	((gpio == PC07) && (func == SDMMC2_D7_FUNC           )) ? 10 : \
	((gpio == PC07) && (func == SDMMC1_D7_FUNC           )) ? 12 : \
	((gpio == PC07) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PC07) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PC08) && (func == DEBUG_TRACED0_FUNC       )) ?  0 : \
	((gpio == PC08) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PC08) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PC08) && (func == UART4_TX_FUNC            )) ?  6 : \
	((gpio == PC08) && (func == USART6_CK_FUNC           )) ?  7 : \
	((gpio == PC08) && (func == UART5_DE_FUNC            )) ?  8 : \
	((gpio == PC08) && (func == UART5_RTS_FUNC           )) ?  8 : \
	((gpio == PC08) && (func == SDMMC1_D0_FUNC           )) ? 12 : \
	((gpio == PC08) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PC09) && (func == DEBUG_TRACED1_FUNC       )) ?  0 : \
	((gpio == PC09) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PC09) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PC09) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PC09) && (func == I2S_CKIN_FUNC            )) ?  5 : \
	((gpio == PC09) && (func == UART5_CTS_FUNC           )) ?  8 : \
	((gpio == PC09) && (func == QUADSPI_BK1_IO0_FUNC     )) ?  9 : \
	((gpio == PC09) && (func == SDMMC1_D1_FUNC           )) ? 12 : \
	((gpio == PC09) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PC09) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PC10) && (func == DEBUG_TRACED2_FUNC       )) ?  0 : \
	((gpio == PC10) && (func == DFSDM1_CKIN5_FUNC        )) ?  3 : \
	((gpio == PC10) && (func == I2S3_CK_FUNC             )) ?  6 : \
	((gpio == PC10) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PC10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC10) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PC10) && (func == QUADSPI_BK1_IO1_FUNC     )) ?  9 : \
	((gpio == PC10) && (func == SAI4_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PC10) && (func == SDMMC1_D2_FUNC           )) ? 12 : \
	((gpio == PC10) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PC10) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PC11) && (func == DEBUG_TRACED3_FUNC       )) ?  0 : \
	((gpio == PC11) && (func == DFSDM1_DATIN5_FUNC       )) ?  3 : \
	((gpio == PC11) && (func == I2S3_SDI_FUNC            )) ?  6 : \
	((gpio == PC11) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PC11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC11) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PC11) && (func == QUADSPI_BK2_NCS_FUNC     )) ?  9 : \
	((gpio == PC11) && (func == SAI4_SCK_B_FUNC          )) ? 10 : \
	((gpio == PC11) && (func == SDMMC1_D3_FUNC           )) ? 12 : \
	((gpio == PC11) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PC12) && (func == DEBUG_TRACECLK_FUNC      )) ?  0 : \
	((gpio == PC12) && (func == RCC_MCO_2_FUNC           )) ?  1 : \
	((gpio == PC12) && (func == SAI4_D3_FUNC             )) ?  2 : \
	((gpio == PC12) && (func == I2S3_SDO_FUNC            )) ?  6 : \
	((gpio == PC12) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PC12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PC12) && (func == UART5_TX_FUNC            )) ?  8 : \
	((gpio == PC12) && (func == SAI4_SD_B_FUNC           )) ? 10 : \
	((gpio == PC12) && (func == SDMMC1_CK_FUNC           )) ? 12 : \
	((gpio == PC12) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PD00) && (func == I2C6_SDA_FUNC            )) ?  2 : \
	((gpio == PD00) && (func == DFSDM1_CKIN6_FUNC        )) ?  3 : \
	((gpio == PD00) && (func == I2C5_SDA_FUNC            )) ?  4 : \
	((gpio == PD00) && (func == SAI3_SCK_A_FUNC          )) ?  6 : \
	((gpio == PD00) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PD00) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PD00) && (func == SDMMC3_CMD_FUNC          )) ? 10 : \
	((gpio == PD00) && (func == DFSDM1_DATIN7_FUNC       )) ? 11 : \
	((gpio == PD00) && (func == FMC_D2_FUNC              )) ? 12 : \
	((gpio == PD00) && (func == FMC_DA2_FUNC             )) ? 12 : \
	((gpio == PD01) && (func == I2C6_SCL_FUNC            )) ?  2 : \
	((gpio == PD01) && (func == DFSDM1_DATIN6_FUNC       )) ?  3 : \
	((gpio == PD01) && (func == I2C5_SCL_FUNC            )) ?  4 : \
	((gpio == PD01) && (func == SAI3_SD_A_FUNC           )) ?  6 : \
	((gpio == PD01) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PD01) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PD01) && (func == SDMMC3_D0_FUNC           )) ? 10 : \
	((gpio == PD01) && (func == DFSDM1_CKIN7_FUNC        )) ? 11 : \
	((gpio == PD01) && (func == FMC_D3_FUNC              )) ? 12 : \
	((gpio == PD01) && (func == FMC_DA3_FUNC             )) ? 12 : \
	((gpio == PD02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PD02) && (func == I2C5_SMBA_FUNC           )) ?  4 : \
	((gpio == PD02) && (func == UART4_RX_FUNC            )) ?  6 : \
	((gpio == PD02) && (func == UART5_RX_FUNC            )) ?  8 : \
	((gpio == PD02) && (func == SDMMC1_CMD_FUNC          )) ? 12 : \
	((gpio == PD02) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PD03) && (func == HDP_HDP5_FUNC            )) ?  0 : \
	((gpio == PD03) && (func == DFSDM1_CKOUT_FUNC        )) ?  3 : \
	((gpio == PD03) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PD03) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PD03) && (func == DFSDM1_DATIN0_FUNC       )) ?  6 : \
	((gpio == PD03) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PD03) && (func == USART2_NSS_FUNC          )) ?  7 : \
	((gpio == PD03) && (func == SDMMC1_D123DIR_FUNC      )) ?  8 : \
	((gpio == PD03) && (func == SDMMC2_D7_FUNC           )) ?  9 : \
	((gpio == PD03) && (func == SDMMC2_D123DIR_FUNC      )) ? 10 : \
	((gpio == PD03) && (func == SDMMC1_D7_FUNC           )) ? 11 : \
	((gpio == PD03) && (func == FMC_CLK_FUNC             )) ? 12 : \
	((gpio == PD03) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PD03) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PD04) && (func == SAI3_FS_A_FUNC           )) ?  6 : \
	((gpio == PD04) && (func == USART2_DE_FUNC           )) ?  7 : \
	((gpio == PD04) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PD04) && (func == SDMMC3_D1_FUNC           )) ? 10 : \
	((gpio == PD04) && (func == DFSDM1_CKIN0_FUNC        )) ? 11 : \
	((gpio == PD04) && (func == FMC_NOE_FUNC             )) ? 12 : \
	((gpio == PD05) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PD05) && (func == SDMMC3_D2_FUNC           )) ? 10 : \
	((gpio == PD05) && (func == FMC_NWE_FUNC             )) ? 12 : \
	((gpio == PD06) && (func == TIM16_CH1N_FUNC          )) ?  1 : \
	((gpio == PD06) && (func == SAI1_D1_FUNC             )) ?  2 : \
	((gpio == PD06) && (func == DFSDM1_CKIN4_FUNC        )) ?  3 : \
	((gpio == PD06) && (func == DFSDM1_DATIN1_FUNC       )) ?  4 : \
	((gpio == PD06) && (func == I2S3_SDO_FUNC            )) ?  5 : \
	((gpio == PD06) && (func == SPI3_MOSI_FUNC           )) ?  5 : \
	((gpio == PD06) && (func == SAI1_SD_A_FUNC           )) ?  6 : \
	((gpio == PD06) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PD06) && (func == FMC_NWAIT_FUNC           )) ? 12 : \
	((gpio == PD06) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PD06) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PD07) && (func == DEBUG_TRACED6_FUNC       )) ?  0 : \
	((gpio == PD07) && (func == DFSDM1_DATIN4_FUNC       )) ?  3 : \
	((gpio == PD07) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PD07) && (func == DFSDM1_CKIN1_FUNC        )) ?  6 : \
	((gpio == PD07) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PD07) && (func == SPDIFRX_IN0_FUNC         )) ?  9 : \
	((gpio == PD07) && (func == SDMMC3_D3_FUNC           )) ? 10 : \
	((gpio == PD07) && (func == FMC_NE1_FUNC             )) ? 12 : \
	((gpio == PD08) && (func == DFSDM1_CKIN3_FUNC        )) ?  3 : \
	((gpio == PD08) && (func == SAI3_SCK_B_FUNC          )) ?  6 : \
	((gpio == PD08) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PD08) && (func == SPDIFRX_IN1_FUNC         )) ?  9 : \
	((gpio == PD08) && (func == FMC_D13_FUNC             )) ? 12 : \
	((gpio == PD08) && (func == FMC_DA13_FUNC            )) ? 12 : \
	((gpio == PD08) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PD09) && (func == DFSDM1_DATIN3_FUNC       )) ?  3 : \
	((gpio == PD09) && (func == SAI3_SD_B_FUNC           )) ?  6 : \
	((gpio == PD09) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PD09) && (func == FMC_D14_FUNC             )) ? 12 : \
	((gpio == PD09) && (func == FMC_DA14_FUNC            )) ? 12 : \
	((gpio == PD09) && (func == DCMI_HSYNC_FUNC          )) ? 13 : \
	((gpio == PD09) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PD10) && (func == RTC_REFIN_FUNC           )) ?  0 : \
	((gpio == PD10) && (func == TIM16_BKIN_FUNC          )) ?  1 : \
	((gpio == PD10) && (func == DFSDM1_CKOUT_FUNC        )) ?  3 : \
	((gpio == PD10) && (func == I2C5_SMBA_FUNC           )) ?  4 : \
	((gpio == PD10) && (func == I2S3_SDI_FUNC            )) ?  5 : \
	((gpio == PD10) && (func == SPI3_MISO_FUNC           )) ?  5 : \
	((gpio == PD10) && (func == SAI3_FS_B_FUNC           )) ?  6 : \
	((gpio == PD10) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PD10) && (func == FMC_D15_FUNC             )) ? 12 : \
	((gpio == PD10) && (func == FMC_DA15_FUNC            )) ? 12 : \
	((gpio == PD10) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PD11) && (func == LPTIM2_IN2_FUNC          )) ?  3 : \
	((gpio == PD11) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PD11) && (func == I2C1_SMBA_FUNC           )) ?  5 : \
	((gpio == PD11) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PD11) && (func == USART3_NSS_FUNC          )) ?  7 : \
	((gpio == PD11) && (func == QUADSPI_BK1_IO0_FUNC     )) ?  9 : \
	((gpio == PD11) && (func == SAI2_SD_A_FUNC           )) ? 10 : \
	((gpio == PD11) && (func == FMC_A16_FUNC             )) ? 12 : \
	((gpio == PD11) && (func == FMC_CLE_FUNC             )) ? 12 : \
	((gpio == PD12) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PD12) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PD12) && (func == LPTIM2_IN1_FUNC          )) ?  3 : \
	((gpio == PD12) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PD12) && (func == I2C1_SCL_FUNC            )) ?  5 : \
	((gpio == PD12) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PD12) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PD12) && (func == QUADSPI_BK1_IO1_FUNC     )) ?  9 : \
	((gpio == PD12) && (func == SAI2_FS_A_FUNC           )) ? 10 : \
	((gpio == PD12) && (func == FMC_A17_FUNC             )) ? 12 : \
	((gpio == PD12) && (func == FMC_ALE_FUNC             )) ? 12 : \
	((gpio == PD13) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PD13) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PD13) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PD13) && (func == I2C1_SDA_FUNC            )) ?  5 : \
	((gpio == PD13) && (func == I2S3_MCK_FUNC            )) ?  6 : \
	((gpio == PD13) && (func == QUADSPI_BK1_IO3_FUNC     )) ?  9 : \
	((gpio == PD13) && (func == SAI2_SCK_A_FUNC          )) ? 10 : \
	((gpio == PD13) && (func == FMC_A18_FUNC             )) ? 12 : \
	((gpio == PD13) && (func == DSIHOST_TE_FUNC          )) ? 13 : \
	((gpio == PD14) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PD14) && (func == SAI3_MCLK_B_FUNC         )) ?  6 : \
	((gpio == PD14) && (func == UART8_CTS_FUNC           )) ?  8 : \
	((gpio == PD14) && (func == FMC_D0_FUNC              )) ? 12 : \
	((gpio == PD14) && (func == FMC_DA0_FUNC             )) ? 12 : \
	((gpio == PD15) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PD15) && (func == SAI3_MCLK_A_FUNC         )) ?  6 : \
	((gpio == PD15) && (func == UART8_CTS_FUNC           )) ?  8 : \
	((gpio == PD15) && (func == FMC_D1_FUNC              )) ? 12 : \
	((gpio == PD15) && (func == FMC_DA1_FUNC             )) ? 12 : \
	((gpio == PD15) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PE00) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PE00) && (func == TIM4_ETR_FUNC            )) ?  2 : \
	((gpio == PE00) && (func == LPTIM2_ETR_FUNC          )) ?  4 : \
	((gpio == PE00) && (func == I2S3_CK_FUNC             )) ?  5 : \
	((gpio == PE00) && (func == SPI3_SCK_FUNC            )) ?  5 : \
	((gpio == PE00) && (func == SAI4_MCLK_B_FUNC         )) ?  6 : \
	((gpio == PE00) && (func == UART8_RX_FUNC            )) ?  8 : \
	((gpio == PE00) && (func == SAI2_MCLK_A_FUNC         )) ? 10 : \
	((gpio == PE00) && (func == FMC_NBL0_FUNC            )) ? 12 : \
	((gpio == PE00) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PE01) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PE01) && (func == I2S2_MCK_FUNC            )) ?  5 : \
	((gpio == PE01) && (func == SAI3_SD_B_FUNC           )) ?  6 : \
	((gpio == PE01) && (func == UART8_TX_FUNC            )) ?  8 : \
	((gpio == PE01) && (func == FMC_NBL1_FUNC            )) ? 12 : \
	((gpio == PE01) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PE02) && (func == DEBUG_TRACECLK_FUNC      )) ?  0 : \
	((gpio == PE02) && (func == SAI1_CK1_FUNC            )) ?  2 : \
	((gpio == PE02) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PE02) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE02) && (func == SAI1_MCLK_A_FUNC         )) ?  6 : \
	((gpio == PE02) && (func == QUADSPI_BK1_IO2_FUNC     )) ?  9 : \
	((gpio == PE02) && (func == ETH1_TXD3_FUNC           )) ? 11 : \
	((gpio == PE02) && (func == FMC_A23_FUNC             )) ? 12 : \
	((gpio == PE03) && (func == DEBUG_TRACED0_FUNC       )) ?  0 : \
	((gpio == PE03) && (func == TIM15_BKIN_FUNC          )) ?  4 : \
	((gpio == PE03) && (func == SAI1_SD_B_FUNC           )) ?  6 : \
	((gpio == PE03) && (func == SDMMC2_CK_FUNC           )) ?  9 : \
	((gpio == PE03) && (func == FMC_A19_FUNC             )) ? 12 : \
	((gpio == PE04) && (func == DEBUG_TRACED1_FUNC       )) ?  0 : \
	((gpio == PE04) && (func == SAI1_D2_FUNC             )) ?  2 : \
	((gpio == PE04) && (func == DFSDM1_DATIN3_FUNC       )) ?  3 : \
	((gpio == PE04) && (func == TIM15_CH1N_FUNC          )) ?  4 : \
	((gpio == PE04) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE04) && (func == SAI1_FS_A_FUNC           )) ?  6 : \
	((gpio == PE04) && (func == SDMMC2_CKIN_FUNC         )) ?  7 : \
	((gpio == PE04) && (func == SDMMC1_CKIN_FUNC         )) ?  8 : \
	((gpio == PE04) && (func == SDMMC2_D4_FUNC           )) ?  9 : \
	((gpio == PE04) && (func == SDMMC1_D4_FUNC           )) ? 11 : \
	((gpio == PE04) && (func == FMC_A20_FUNC             )) ? 12 : \
	((gpio == PE04) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PE04) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PE05) && (func == DEBUG_TRACED3_FUNC       )) ?  0 : \
	((gpio == PE05) && (func == SAI1_CK2_FUNC            )) ?  2 : \
	((gpio == PE05) && (func == DFSDM1_CKIN3_FUNC        )) ?  3 : \
	((gpio == PE05) && (func == TIM15_CH1_FUNC           )) ?  4 : \
	((gpio == PE05) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE05) && (func == SAI1_SCK_A_FUNC          )) ?  6 : \
	((gpio == PE05) && (func == SDMMC2_D0DIR_FUNC        )) ?  7 : \
	((gpio == PE05) && (func == SDMMC1_D0DIR_FUNC        )) ?  8 : \
	((gpio == PE05) && (func == SDMMC2_D6_FUNC           )) ?  9 : \
	((gpio == PE05) && (func == SDMMC1_D6_FUNC           )) ? 11 : \
	((gpio == PE05) && (func == FMC_A21_FUNC             )) ? 12 : \
	((gpio == PE05) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PE05) && (func == LTDC_G0_FUNC             )) ? 14 : \
	((gpio == PE06) && (func == DEBUG_TRACED2_FUNC       )) ?  0 : \
	((gpio == PE06) && (func == TIM1_BKIN2_FUNC          )) ?  1 : \
	((gpio == PE06) && (func == SAI1_D1_FUNC             )) ?  2 : \
	((gpio == PE06) && (func == TIM15_CH2_FUNC           )) ?  4 : \
	((gpio == PE06) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE06) && (func == SAI1_SD_A_FUNC           )) ?  6 : \
	((gpio == PE06) && (func == SDMMC2_D0_FUNC           )) ?  7 : \
	((gpio == PE06) && (func == SDMMC1_D2_FUNC           )) ?  8 : \
	((gpio == PE06) && (func == SAI2_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PE06) && (func == FMC_A22_FUNC             )) ? 12 : \
	((gpio == PE06) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PE06) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PE07) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PE07) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PE07) && (func == DFSDM1_DATIN2_FUNC       )) ?  3 : \
	((gpio == PE07) && (func == UART7_RX_FUNC            )) ?  7 : \
	((gpio == PE07) && (func == QUADSPI_BK2_IO0_FUNC     )) ? 10 : \
	((gpio == PE07) && (func == FMC_D4_FUNC              )) ? 12 : \
	((gpio == PE07) && (func == FMC_DA4_FUNC             )) ? 12 : \
	((gpio == PE08) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PE08) && (func == DFSDM1_CKIN2_FUNC        )) ?  3 : \
	((gpio == PE08) && (func == UART7_TX_FUNC            )) ?  7 : \
	((gpio == PE08) && (func == QUADSPI_BK2_IO1_FUNC     )) ? 10 : \
	((gpio == PE08) && (func == FMC_D5_FUNC              )) ? 12 : \
	((gpio == PE08) && (func == FMC_DA5_FUNC             )) ? 12 : \
	((gpio == PE09) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PE09) && (func == DFSDM1_CKOUT_FUNC        )) ?  3 : \
	((gpio == PE09) && (func == UART7_DE_FUNC            )) ?  7 : \
	((gpio == PE09) && (func == UART7_RTS_FUNC           )) ?  7 : \
	((gpio == PE09) && (func == QUADSPI_BK2_IO2_FUNC     )) ? 10 : \
	((gpio == PE09) && (func == FMC_D6_FUNC              )) ? 12 : \
	((gpio == PE09) && (func == FMC_DA6_FUNC             )) ? 12 : \
	((gpio == PE10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PE10) && (func == DFSDM1_DATIN4_FUNC       )) ?  3 : \
	((gpio == PE10) && (func == UART7_CTS_FUNC           )) ?  7 : \
	((gpio == PE10) && (func == QUADSPI_BK2_IO3_FUNC     )) ? 10 : \
	((gpio == PE10) && (func == FMC_D7_FUNC              )) ? 12 : \
	((gpio == PE10) && (func == FMC_DA7_FUNC             )) ? 12 : \
	((gpio == PE11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PE11) && (func == DFSDM1_CKIN4_FUNC        )) ?  3 : \
	((gpio == PE11) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE11) && (func == USART6_CK_FUNC           )) ?  7 : \
	((gpio == PE11) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PE11) && (func == FMC_D8_FUNC              )) ? 12 : \
	((gpio == PE11) && (func == FMC_DA8_FUNC             )) ? 12 : \
	((gpio == PE11) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PE11) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PE12) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PE12) && (func == DFSDM1_DATIN5_FUNC       )) ?  3 : \
	((gpio == PE12) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE12) && (func == SDMMC1_D0DIR_FUNC        )) ?  8 : \
	((gpio == PE12) && (func == SAI2_SCK_B_FUNC          )) ? 10 : \
	((gpio == PE12) && (func == FMC_D9_FUNC              )) ? 12 : \
	((gpio == PE12) && (func == FMC_DA9_FUNC             )) ? 12 : \
	((gpio == PE12) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PE13) && (func == HDP_HDP2_FUNC            )) ?  0 : \
	((gpio == PE13) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PE13) && (func == DFSDM1_CKIN5_FUNC        )) ?  3 : \
	((gpio == PE13) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE13) && (func == SAI2_FS_B_FUNC           )) ? 10 : \
	((gpio == PE13) && (func == FMC_D10_FUNC             )) ? 12 : \
	((gpio == PE13) && (func == FMC_DA10_FUNC            )) ? 12 : \
	((gpio == PE13) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PE13) && (func == LTDC_DE_FUNC             )) ? 14 : \
	((gpio == PE14) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PE14) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == UART8_DE_FUNC            )) ?  8 : \
	((gpio == PE14) && (func == UART8_RTS_FUNC           )) ?  8 : \
	((gpio == PE14) && (func == SAI2_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PE14) && (func == SDMMC1_D123DIR_FUNC      )) ? 11 : \
	((gpio == PE14) && (func == FMC_D11_FUNC             )) ? 12 : \
	((gpio == PE14) && (func == FMC_DA11_FUNC            )) ? 12 : \
	((gpio == PE14) && (func == LTDC_G0_FUNC             )) ? 13 : \
	((gpio == PE14) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PE15) && (func == HDP_HDP3_FUNC            )) ?  0 : \
	((gpio == PE15) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PE15) && (func == TIM15_BKIN_FUNC          )) ?  4 : \
