UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32mpu_pinmux.h
	((gpio == PE15) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PE15) && (func == USART2_NSS_FUNC          )) ?  7 : \
	((gpio == PE15) && (func == UART8_CTS_FUNC           )) ?  8 : \
	((gpio == PE15) && (func == FMC_NCE2_FUNC            )) ? 10 : \
	((gpio == PE15) && (func == FMC_D12_FUNC             )) ? 12 : \
	((gpio == PE15) && (func == FMC_DA12_FUNC            )) ? 12 : \
	((gpio == PE15) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PF00) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PF00) && (func == SDMMC3_D0_FUNC           )) ?  9 : \
	((gpio == PF00) && (func == SDMMC3_CKIN_FUNC         )) ? 10 : \
	((gpio == PF00) && (func == FMC_A0_FUNC              )) ? 12 : \
	((gpio == PF01) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PF01) && (func == SDMMC3_CMD_FUNC          )) ?  9 : \
	((gpio == PF01) && (func == SDMMC3_CDIR_FUNC         )) ? 10 : \
	((gpio == PF01) && (func == FMC_A1_FUNC              )) ? 12 : \
	((gpio == PF02) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PF02) && (func == SDMMC2_D0DIR_FUNC        )) ?  9 : \
	((gpio == PF02) && (func == SDMMC3_D0DIR_FUNC        )) ? 10 : \
	((gpio == PF02) && (func == SDMMC1_D0DIR_FUNC        )) ? 11 : \
	((gpio == PF02) && (func == FMC_A2_FUNC              )) ? 12 : \
	((gpio == PF03) && (func == ETH1_TX_ER_FUNC          )) ? 11 : \
	((gpio == PF03) && (func == FMC_A3_FUNC              )) ? 12 : \
	((gpio == PF04) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PF04) && (func == SDMMC3_D1_FUNC           )) ?  9 : \
	((gpio == PF04) && (func == SDMMC3_D123DIR_FUNC      )) ? 10 : \
	((gpio == PF04) && (func == FMC_A4_FUNC              )) ? 12 : \
	((gpio == PF05) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PF05) && (func == SDMMC3_D2_FUNC           )) ?  9 : \
	((gpio == PF05) && (func == FMC_A5_FUNC              )) ? 12 : \
	((gpio == PF06) && (func == TIM16_CH1_FUNC           )) ?  1 : \
	((gpio == PF06) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PF06) && (func == SAI1_SD_B_FUNC           )) ?  6 : \
	((gpio == PF06) && (func == UART7_RX_FUNC            )) ?  7 : \
	((gpio == PF06) && (func == QUADSPI_BK1_IO3_FUNC     )) ?  9 : \
	((gpio == PF06) && (func == SAI4_SCK_B_FUNC          )) ? 12 : \
	((gpio == PF07) && (func == TIM17_CH1_FUNC           )) ?  1 : \
	((gpio == PF07) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PF07) && (func == SAI1_MCLK_B_FUNC         )) ?  6 : \
	((gpio == PF07) && (func == UART7_TX_FUNC            )) ?  7 : \
	((gpio == PF07) && (func == QUADSPI_BK1_IO2_FUNC     )) ?  9 : \
	((gpio == PF08) && (func == DEBUG_TRACED12_FUNC      )) ?  0 : \
	((gpio == PF08) && (func == TIM16_CH1N_FUNC          )) ?  1 : \
	((gpio == PF08) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PF08) && (func == SAI1_SCK_B_FUNC          )) ?  6 : \
	((gpio == PF08) && (func == UART7_DE_FUNC            )) ?  7 : \
	((gpio == PF08) && (func == UART7_RTS_FUNC           )) ?  7 : \
	((gpio == PF08) && (func == TIM13_CH1_FUNC           )) ?  9 : \
	((gpio == PF08) && (func == QUADSPI_BK1_IO0_FUNC     )) ? 10 : \
	((gpio == PF09) && (func == DEBUG_TRACED13_FUNC      )) ?  0 : \
	((gpio == PF09) && (func == TIM17_CH1N_FUNC          )) ?  1 : \
	((gpio == PF09) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PF09) && (func == SAI1_FS_B_FUNC           )) ?  6 : \
	((gpio == PF09) && (func == UART7_CTS_FUNC           )) ?  7 : \
	((gpio == PF09) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PF09) && (func == QUADSPI_BK1_IO1_FUNC     )) ? 10 : \
	((gpio == PF10) && (func == TIM16_BKIN_FUNC          )) ?  1 : \
	((gpio == PF10) && (func == SAI1_D3_FUNC             )) ?  2 : \
	((gpio == PF10) && (func == SAI4_D4_FUNC             )) ?  3 : \
	((gpio == PF10) && (func == SAI1_D4_FUNC             )) ?  6 : \
	((gpio == PF10) && (func == QUADSPI_CLK_FUNC         )) ?  9 : \
	((gpio == PF10) && (func == SAI4_D3_FUNC             )) ? 12 : \
	((gpio == PF10) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PF10) && (func == LTDC_DE_FUNC             )) ? 14 : \
	((gpio == PF11) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PF11) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PF11) && (func == DCMI_D12_FUNC            )) ? 13 : \
	((gpio == PF11) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PF12) && (func == DEBUG_TRACED4_FUNC       )) ?  0 : \
	((gpio == PF12) && (func == ETH1_RXD4_FUNC           )) ? 11 : \
	((gpio == PF12) && (func == FMC_A6_FUNC              )) ? 12 : \
	((gpio == PF13) && (func == DEBUG_TRACED5_FUNC       )) ?  0 : \
	((gpio == PF13) && (func == DFSDM1_DATIN6_FUNC       )) ?  3 : \
	((gpio == PF13) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PF13) && (func == I2C1_SMBA_FUNC           )) ?  5 : \
	((gpio == PF13) && (func == DFSDM1_DATIN3_FUNC       )) ?  6 : \
	((gpio == PF13) && (func == ETH1_RXD5_FUNC           )) ? 11 : \
	((gpio == PF13) && (func == FMC_A7_FUNC              )) ? 12 : \
	((gpio == PF14) && (func == DEBUG_TRACED6_FUNC       )) ?  0 : \
	((gpio == PF14) && (func == DFSDM1_CKIN6_FUNC        )) ?  3 : \
	((gpio == PF14) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PF14) && (func == I2C1_SCL_FUNC            )) ?  5 : \
	((gpio == PF14) && (func == ETH1_RXD6_FUNC           )) ? 11 : \
	((gpio == PF14) && (func == FMC_A8_FUNC              )) ? 12 : \
	((gpio == PF15) && (func == DEBUG_TRACED7_FUNC       )) ?  0 : \
	((gpio == PF15) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PF15) && (func == I2C1_SDA_FUNC            )) ?  5 : \
	((gpio == PF15) && (func == ETH1_RXD7_FUNC           )) ? 11 : \
	((gpio == PF15) && (func == FMC_A9_FUNC              )) ? 12 : \
	((gpio == PG00) && (func == DEBUG_TRACED0_FUNC       )) ?  0 : \
	((gpio == PG00) && (func == DFSDM1_DATIN0_FUNC       )) ?  3 : \
	((gpio == PG00) && (func == ETH1_TXD4_FUNC           )) ? 11 : \
	((gpio == PG00) && (func == FMC_A10_FUNC             )) ? 12 : \
	((gpio == PG01) && (func == DEBUG_TRACED1_FUNC       )) ?  0 : \
	((gpio == PG01) && (func == ETH1_TXD5_FUNC           )) ? 11 : \
	((gpio == PG01) && (func == FMC_A11_FUNC             )) ? 12 : \
	((gpio == PG02) && (func == DEBUG_TRACED2_FUNC       )) ?  0 : \
	((gpio == PG02) && (func == RCC_MCO_2_FUNC           )) ?  1 : \
	((gpio == PG02) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PG02) && (func == ETH1_TXD6_FUNC           )) ? 11 : \
	((gpio == PG02) && (func == FMC_A12_FUNC             )) ? 12 : \
	((gpio == PG03) && (func == DEBUG_TRACED3_FUNC       )) ?  0 : \
	((gpio == PG03) && (func == TIM8_BKIN2_FUNC          )) ?  3 : \
	((gpio == PG03) && (func == DFSDM1_CKIN1_FUNC        )) ?  4 : \
	((gpio == PG03) && (func == ETH1_TXD7_FUNC           )) ? 11 : \
	((gpio == PG03) && (func == FMC_A13_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == TIM1_BKIN2_FUNC          )) ?  1 : \
	((gpio == PG04) && (func == ETH1_GTX_CLK_FUNC        )) ? 11 : \
	((gpio == PG04) && (func == FMC_A14_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PG05) && (func == ETH1_CLK125_FUNC         )) ? 11 : \
	((gpio == PG05) && (func == FMC_A15_FUNC             )) ? 12 : \
	((gpio == PG06) && (func == DEBUG_TRACED14_FUNC      )) ?  0 : \
	((gpio == PG06) && (func == TIM17_BKIN_FUNC          )) ?  1 : \
	((gpio == PG06) && (func == SDMMC2_CMD_FUNC          )) ? 10 : \
	((gpio == PG06) && (func == DCMI_D12_FUNC            )) ? 13 : \
	((gpio == PG06) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PG07) && (func == DEBUG_TRACED5_FUNC       )) ?  0 : \
	((gpio == PG07) && (func == SAI1_MCLK_A_FUNC         )) ?  6 : \
	((gpio == PG07) && (func == USART6_CK_FUNC           )) ?  7 : \
	((gpio == PG07) && (func == UART8_DE_FUNC            )) ?  8 : \
	((gpio == PG07) && (func == UART8_RTS_FUNC           )) ?  8 : \
	((gpio == PG07) && (func == QUADSPI_CLK_FUNC         )) ?  9 : \
	((gpio == PG07) && (func == QUADSPI_BK2_IO3_FUNC     )) ? 11 : \
	((gpio == PG07) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PG07) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PG08) && (func == DEBUG_TRACED15_FUNC      )) ?  0 : \
	((gpio == PG08) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PG08) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PG08) && (func == ETH1_CLK_FUNC            )) ?  2 : \
	((gpio == PG08) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PG08) && (func == SPI6_NSS_FUNC            )) ?  5 : \
	((gpio == PG08) && (func == SAI4_D2_FUNC             )) ?  6 : \
	((gpio == PG08) && (func == USART6_DE_FUNC           )) ?  7 : \
	((gpio == PG08) && (func == USART6_RTS_FUNC          )) ?  7 : \
	((gpio == PG08) && (func == USART3_DE_FUNC           )) ?  8 : \
	((gpio == PG08) && (func == USART3_RTS_FUNC          )) ?  8 : \
	((gpio == PG08) && (func == SPDIFRX_IN2_FUNC         )) ?  9 : \
	((gpio == PG08) && (func == SAI4_FS_A_FUNC           )) ? 10 : \
	((gpio == PG08) && (func == ETH1_PPS_OUT_FUNC        )) ? 11 : \
	((gpio == PG08) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PG09) && (func == DEBUG_DBTRGO_FUNC        )) ?  0 : \
	((gpio == PG09) && (func == USART6_RX_FUNC           )) ?  7 : \
	((gpio == PG09) && (func == SPDIFRX_IN3_FUNC         )) ?  8 : \
	((gpio == PG09) && (func == QUADSPI_BK2_IO2_FUNC     )) ?  9 : \
	((gpio == PG09) && (func == SAI2_FS_B_FUNC           )) ? 10 : \
	((gpio == PG09) && (func == FMC_NCE_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == FMC_NE2_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PG09) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PG10) && (func == DEBUG_TRACED10_FUNC      )) ?  0 : \
	((gpio == PG10) && (func == UART8_CTS_FUNC           )) ?  8 : \
	((gpio == PG10) && (func == LTDC_G3_FUNC             )) ?  9 : \
	((gpio == PG10) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PG10) && (func == QUADSPI_BK2_IO2_FUNC     )) ? 11 : \
	((gpio == PG10) && (func == FMC_NE3_FUNC             )) ? 12 : \
	((gpio == PG10) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PG10) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PG11) && (func == DEBUG_TRACED11_FUNC      )) ?  0 : \
	((gpio == PG11) && (func == USART1_TX_FUNC           )) ?  4 : \
	((gpio == PG11) && (func == UART4_TX_FUNC            )) ?  6 : \
	((gpio == PG11) && (func == SPDIFRX_IN0_FUNC         )) ?  8 : \
	((gpio == PG11) && (func == ETH1_TX_CTL_FUNC         )) ? 11 : \
	((gpio == PG11) && (func == ETH1_TX_EN_FUNC          )) ? 11 : \
	((gpio == PG11) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PG11) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PG12) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PG12) && (func == SPI6_MISO_FUNC           )) ?  5 : \
	((gpio == PG12) && (func == SAI4_CK2_FUNC            )) ?  6 : \
	((gpio == PG12) && (func == USART6_DE_FUNC           )) ?  7 : \
	((gpio == PG12) && (func == USART6_RTS_FUNC          )) ?  7 : \
	((gpio == PG12) && (func == SPDIFRX_IN1_FUNC         )) ?  8 : \
	((gpio == PG12) && (func == LTDC_B4_FUNC             )) ?  9 : \
	((gpio == PG12) && (func == SAI4_SCK_A_FUNC          )) ? 10 : \
	((gpio == PG12) && (func == ETH1_PHY_INTN_FUNC       )) ? 11 : \
	((gpio == PG12) && (func == FMC_NE4_FUNC             )) ? 12 : \
	((gpio == PG12) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PG13) && (func == DEBUG_TRACED0_FUNC       )) ?  0 : \
	((gpio == PG13) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PG13) && (func == SAI1_CK2_FUNC            )) ?  2 : \
	((gpio == PG13) && (func == SAI4_CK1_FUNC            )) ?  4 : \
	((gpio == PG13) && (func == SPI6_SCK_FUNC            )) ?  5 : \
	((gpio == PG13) && (func == SAI1_SCK_A_FUNC          )) ?  6 : \
	((gpio == PG13) && (func == USART6_CTS_FUNC          )) ?  7 : \
	((gpio == PG13) && (func == USART6_NSS_FUNC          )) ?  7 : \
	((gpio == PG13) && (func == SAI4_MCLK_A_FUNC         )) ? 10 : \
	((gpio == PG13) && (func == ETH1_TXD0_FUNC           )) ? 11 : \
	((gpio == PG13) && (func == FMC_A24_FUNC             )) ? 12 : \
	((gpio == PG13) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PG14) && (func == DEBUG_TRACED1_FUNC       )) ?  0 : \
	((gpio == PG14) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PG14) && (func == SPI6_MOSI_FUNC           )) ?  5 : \
	((gpio == PG14) && (func == SAI4_D1_FUNC             )) ?  6 : \
	((gpio == PG14) && (func == USART6_TX_FUNC           )) ?  7 : \
	((gpio == PG14) && (func == QUADSPI_BK2_IO3_FUNC     )) ?  9 : \
	((gpio == PG14) && (func == SAI4_SD_A_FUNC           )) ? 10 : \
	((gpio == PG14) && (func == ETH1_TXD1_FUNC           )) ? 11 : \
	((gpio == PG14) && (func == FMC_A25_FUNC             )) ? 12 : \
	((gpio == PG14) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PG15) && (func == DEBUG_TRACED7_FUNC       )) ?  0 : \
	((gpio == PG15) && (func == SAI1_D2_FUNC             )) ?  2 : \
	((gpio == PG15) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PG15) && (func == SAI1_FS_A_FUNC           )) ?  6 : \
	((gpio == PG15) && (func == USART6_CTS_FUNC          )) ?  7 : \
	((gpio == PG15) && (func == USART6_NSS_FUNC          )) ?  7 : \
	((gpio == PG15) && (func == SDMMC3_CK_FUNC           )) ? 10 : \
	((gpio == PG15) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PH02) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PH02) && (func == QUADSPI_BK2_IO0_FUNC     )) ?  9 : \
	((gpio == PH02) && (func == SAI2_SCK_B_FUNC          )) ? 10 : \
	((gpio == PH02) && (func == ETH1_CRS_FUNC            )) ? 11 : \
	((gpio == PH02) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PH03) && (func == DFSDM1_CKIN4_FUNC        )) ?  3 : \
	((gpio == PH03) && (func == QUADSPI_BK2_IO1_FUNC     )) ?  9 : \
	((gpio == PH03) && (func == SAI2_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PH03) && (func == ETH1_COL_FUNC            )) ? 11 : \
	((gpio == PH03) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PH04) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PH04) && (func == LTDC_G5_FUNC             )) ?  9 : \
	((gpio == PH04) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PH05) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PH05) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PH05) && (func == SAI4_SD_B_FUNC           )) ? 12 : \
	((gpio == PH06) && (func == TIM12_CH1_FUNC           )) ?  2 : \
	((gpio == PH06) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PH06) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PH06) && (func == ETH1_RXD2_FUNC           )) ? 11 : \
	((gpio == PH06) && (func == MDIOS_MDIO_FUNC          )) ? 12 : \
	((gpio == PH06) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PH07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PH07) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PH07) && (func == ETH1_RXD3_FUNC           )) ? 11 : \
	((gpio == PH07) && (func == MDIOS_MDC_FUNC           )) ? 12 : \
	((gpio == PH07) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PH08) && (func == TIM5_ETR_FUNC            )) ?  2 : \
	((gpio == PH08) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PH08) && (func == DCMI_HSYNC_FUNC          )) ? 13 : \
	((gpio == PH08) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PH09) && (func == TIM12_CH2_FUNC           )) ?  2 : \
	((gpio == PH09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PH09) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PH09) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PH10) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PH10) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PH10) && (func == I2C1_SMBA_FUNC           )) ?  5 : \
	((gpio == PH10) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PH10) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PH11) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PH11) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PH11) && (func == I2C1_SCL_FUNC            )) ?  5 : \
	((gpio == PH11) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PH11) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PH12) && (func == HDP_HDP2_FUNC            )) ?  0 : \
	((gpio == PH12) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PH12) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PH12) && (func == I2C1_SDA_FUNC            )) ?  5 : \
	((gpio == PH12) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PH12) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PH13) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PH13) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PH13) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PH13) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PH14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PH14) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PH14) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PH14) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PH14) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PH15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PH15) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PH15) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PI00) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PI00) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PI00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PI00) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PI00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PI01) && (func == TIM8_BKIN2_FUNC          )) ?  3 : \
	((gpio == PI01) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PI01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PI01) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PI01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PI02) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PI02) && (func == I2S2_SDI_FUNC            )) ?  5 : \
	((gpio == PI02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PI02) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PI02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PI03) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PI03) && (func == I2S2_SDO_FUNC            )) ?  5 : \
	((gpio == PI03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PI03) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PI04) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PI04) && (func == SAI2_MCLK_A_FUNC         )) ? 10 : \
	((gpio == PI04) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PI04) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PI05) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PI05) && (func == SAI2_SCK_A_FUNC          )) ? 10 : \
	((gpio == PI05) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PI05) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PI06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PI06) && (func == SAI2_SD_A_FUNC           )) ? 10 : \
	((gpio == PI06) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PI06) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PI07) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PI07) && (func == SAI2_FS_A_FUNC           )) ? 10 : \
	((gpio == PI07) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PI07) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PI09) && (func == HDP_HDP1_FUNC            )) ?  0 : \
	((gpio == PI09) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PI09) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PI09) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PI10) && (func == HDP_HDP0_FUNC            )) ?  0 : \
	((gpio == PI10) && (func == USART3_CTS_FUNC          )) ?  8 : \
	((gpio == PI10) && (func == USART3_NSS_FUNC          )) ?  8 : \
	((gpio == PI10) && (func == ETH1_RX_ER_FUNC          )) ? 11 : \
	((gpio == PI10) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PI11) && (func == RCC_MCO_1_FUNC           )) ?  0 : \
	((gpio == PI11) && (func == I2S_CKIN_FUNC            )) ?  5 : \
	((gpio == PI11) && (func == LTDC_G6_FUNC             )) ?  9 : \
	((gpio == PI12) && (func == DEBUG_TRACED0_FUNC       )) ?  0 : \
	((gpio == PI12) && (func == HDP_HDP0_FUNC            )) ?  2 : \
	((gpio == PI12) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PI13) && (func == DEBUG_TRACED1_FUNC       )) ?  0 : \
	((gpio == PI13) && (func == HDP_HDP1_FUNC            )) ?  2 : \
	((gpio == PI13) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PI14) && (func == DEBUG_TRACECLK_FUNC      )) ?  0 : \
	((gpio == PI14) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PI15) && (func == LTDC_G2_FUNC             )) ?  9 : \
	((gpio == PI15) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PJ00) && (func == DEBUG_TRACED8_FUNC       )) ?  0 : \
	((gpio == PJ00) && (func == LTDC_R7_FUNC             )) ?  9 : \
	((gpio == PJ00) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PJ01) && (func == DEBUG_TRACED9_FUNC       )) ?  0 : \
	((gpio == PJ01) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PJ02) && (func == DEBUG_TRACED10_FUNC      )) ?  0 : \
	((gpio == PJ02) && (func == DSIHOST_TE_FUNC          )) ? 13 : \
	((gpio == PJ02) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PJ03) && (func == DEBUG_TRACED11_FUNC      )) ?  0 : \
	((gpio == PJ03) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PJ04) && (func == DEBUG_TRACED12_FUNC      )) ?  0 : \
	((gpio == PJ04) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PJ05) && (func == DEBUG_TRACED2_FUNC       )) ?  0 : \
	((gpio == PJ05) && (func == HDP_HDP2_FUNC            )) ?  2 : \
	((gpio == PJ05) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PJ06) && (func == DEBUG_TRACED3_FUNC       )) ?  0 : \
	((gpio == PJ06) && (func == HDP_HDP3_FUNC            )) ?  2 : \
	((gpio == PJ06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PJ06) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PJ07) && (func == DEBUG_TRACED13_FUNC      )) ?  0 : \
	((gpio == PJ07) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PJ07) && (func == LTDC_G0_FUNC             )) ? 14 : \
	((gpio == PJ08) && (func == DEBUG_TRACED14_FUNC      )) ?  0 : \
	((gpio == PJ08) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PJ08) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PJ08) && (func == UART8_TX_FUNC            )) ?  8 : \
	((gpio == PJ08) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PJ09) && (func == DEBUG_TRACED15_FUNC      )) ?  0 : \
	((gpio == PJ09) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PJ09) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PJ09) && (func == UART8_RX_FUNC            )) ?  8 : \
	((gpio == PJ09) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PJ10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PJ10) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PJ10) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PJ10) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PJ11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
