UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32mpu_pinmux.h
	((gpio == PJ11) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PJ11) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PJ11) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PJ12) && (func == LTDC_G3_FUNC             )) ?  9 : \
	((gpio == PJ12) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PJ13) && (func == LTDC_G4_FUNC             )) ?  9 : \
	((gpio == PJ13) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PJ14) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PJ15) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PK00) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PK00) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PK00) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PK00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PK01) && (func == DEBUG_TRACED4_FUNC       )) ?  0 : \
	((gpio == PK01) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PK01) && (func == HDP_HDP4_FUNC            )) ?  2 : \
	((gpio == PK01) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PK01) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PK01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PK02) && (func == DEBUG_TRACED5_FUNC       )) ?  0 : \
	((gpio == PK02) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PK02) && (func == HDP_HDP5_FUNC            )) ?  2 : \
	((gpio == PK02) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PK02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PK03) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PK04) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PK05) && (func == DEBUG_TRACED6_FUNC       )) ?  0 : \
	((gpio == PK05) && (func == HDP_HDP6_FUNC            )) ?  2 : \
	((gpio == PK05) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PK06) && (func == DEBUG_TRACED7_FUNC       )) ?  0 : \
	((gpio == PK06) && (func == HDP_HDP7_FUNC            )) ?  2 : \
	((gpio == PK06) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PK07) && (func == LTDC_DE_FUNC             )) ? 14 : \
	((gpio == PZ00) && (func == I2C6_SCL_FUNC            )) ?  2 : \
	((gpio == PZ00) && (func == I2C2_SCL_FUNC            )) ?  3 : \
	((gpio == PZ00) && (func == I2S1_CK_FUNC             )) ?  5 : \
	((gpio == PZ00) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PZ00) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PZ00) && (func == SPI6_SCK_FUNC            )) ?  8 : \
	((gpio == PZ01) && (func == I2C6_SDA_FUNC            )) ?  2 : \
	((gpio == PZ01) && (func == I2C2_SDA_FUNC            )) ?  3 : \
	((gpio == PZ01) && (func == I2C5_SDA_FUNC            )) ?  4 : \
	((gpio == PZ01) && (func == I2S1_SDI_FUNC            )) ?  5 : \
	((gpio == PZ01) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PZ01) && (func == I2C4_SDA_FUNC            )) ?  6 : \
	((gpio == PZ01) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PZ01) && (func == SPI6_MISO_FUNC           )) ?  8 : \
	((gpio == PZ02) && (func == I2C6_SCL_FUNC            )) ?  2 : \
	((gpio == PZ02) && (func == I2C2_SCL_FUNC            )) ?  3 : \
	((gpio == PZ02) && (func == I2C5_SMBA_FUNC           )) ?  4 : \
	((gpio == PZ02) && (func == I2S1_SDO_FUNC            )) ?  5 : \
	((gpio == PZ02) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PZ02) && (func == I2C4_SMBA_FUNC           )) ?  6 : \
	((gpio == PZ02) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PZ02) && (func == SPI6_MOSI_FUNC           )) ?  8 : \
	((gpio == PZ03) && (func == I2C6_SDA_FUNC            )) ?  2 : \
	((gpio == PZ03) && (func == I2C2_SDA_FUNC            )) ?  3 : \
	((gpio == PZ03) && (func == I2C5_SDA_FUNC            )) ?  4 : \
	((gpio == PZ03) && (func == I2S1_WS_FUNC             )) ?  5 : \
	((gpio == PZ03) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PZ03) && (func == I2C4_SDA_FUNC            )) ?  6 : \
	((gpio == PZ03) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PZ03) && (func == USART1_NSS_FUNC          )) ?  7 : \
	((gpio == PZ03) && (func == SPI6_NSS_FUNC            )) ?  8 : \
	((gpio == PZ04) && (func == I2C6_SCL_FUNC            )) ?  2 : \
	((gpio == PZ04) && (func == I2C2_SCL_FUNC            )) ?  3 : \
	((gpio == PZ04) && (func == I2C5_SCL_FUNC            )) ?  4 : \
	((gpio == PZ04) && (func == I2C4_SCL_FUNC            )) ?  6 : \
	((gpio == PZ05) && (func == I2C6_SDA_FUNC            )) ?  2 : \
	((gpio == PZ05) && (func == I2C2_SDA_FUNC            )) ?  3 : \
	((gpio == PZ05) && (func == I2C5_SDA_FUNC            )) ?  4 : \
	((gpio == PZ05) && (func == I2C4_SDA_FUNC            )) ?  6 : \
	((gpio == PZ05) && (func == USART1_DE_FUNC           )) ?  7 : \
	((gpio == PZ05) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PZ06) && (func == I2C6_SCL_FUNC            )) ?  2 : \
	((gpio == PZ06) && (func == I2C2_SCL_FUNC            )) ?  3 : \
	((gpio == PZ06) && (func == USART1_CK_FUNC           )) ?  4 : \
	((gpio == PZ06) && (func == I2S1_MCK_FUNC            )) ?  5 : \
	((gpio == PZ06) && (func == I2C4_SMBA_FUNC           )) ?  6 : \
	((gpio == PZ06) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PZ07) && (func == I2C6_SDA_FUNC            )) ?  2 : \
	((gpio == PZ07) && (func == I2C2_SDA_FUNC            )) ?  3 : \
	((gpio == PZ07) && (func == USART1_TX_FUNC           )) ?  7 : \
	AF_NO_SUCH_PINFUNC)

# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA00) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA01) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA01) && (timer_nr == 15) && (channel_nr == -1)) ?  4 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA02) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PA02) && (timer_nr == 15) && (channel_nr ==  1)) ?  4 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA03) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	((gpio == PA03) && (timer_nr == 15) && (channel_nr ==  2)) ?  4 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA05) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PA06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA06) && (timer_nr == 13) && (channel_nr ==  1)) ?  9 : \
	((gpio == PA07) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PA07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA07) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PA07) && (timer_nr == 14) && (channel_nr ==  1)) ?  9 : \
	((gpio == PA08) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA09) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA10) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA11) && (timer_nr ==  1) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB00) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PB01) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB01) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB01) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB04) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB05) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB06) && (timer_nr == 16) && (channel_nr == -1)) ?  1 : \
	((gpio == PB06) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB07) && (timer_nr == 17) && (channel_nr == -1)) ?  1 : \
	((gpio == PB07) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB08) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB08) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB09) && (timer_nr == 17) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB09) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB13) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PB14) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB14) && (timer_nr == 12) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB14) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PB15) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB15) && (timer_nr == 12) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB15) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PC06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PC06) && (timer_nr ==  8) && (channel_nr ==  1)) ?  3 : \
	((gpio == PC07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PC07) && (timer_nr ==  8) && (channel_nr ==  2)) ?  3 : \
	((gpio == PC08) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PC08) && (timer_nr ==  8) && (channel_nr ==  3)) ?  3 : \
	((gpio == PC09) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PC09) && (timer_nr ==  8) && (channel_nr ==  4)) ?  3 : \
	((gpio == PD06) && (timer_nr == 16) && (channel_nr == -1)) ?  1 : \
	((gpio == PD12) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PD13) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PD14) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PD15) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PE04) && (timer_nr == 15) && (channel_nr == -1)) ?  4 : \
	((gpio == PE05) && (timer_nr == 15) && (channel_nr ==  1)) ?  4 : \
	((gpio == PE06) && (timer_nr == 15) && (channel_nr ==  2)) ?  4 : \
	((gpio == PE08) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PE09) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PE10) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PE11) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PE12) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PE13) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PE14) && (timer_nr ==  1) && (channel_nr ==  4)) ?  1 : \
	((gpio == PF06) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PF07) && (timer_nr == 17) && (channel_nr ==  1)) ?  1 : \
	((gpio == PF08) && (timer_nr == 16) && (channel_nr == -1)) ?  1 : \
	((gpio == PF08) && (timer_nr == 13) && (channel_nr ==  1)) ?  9 : \
	((gpio == PF09) && (timer_nr == 17) && (channel_nr == -1)) ?  1 : \
	((gpio == PF09) && (timer_nr == 14) && (channel_nr ==  1)) ?  9 : \
	((gpio == PG08) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PH06) && (timer_nr == 12) && (channel_nr ==  1)) ?  2 : \
	((gpio == PH09) && (timer_nr == 12) && (channel_nr ==  2)) ?  2 : \
	((gpio == PH10) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PH11) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PH12) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PH13) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PH14) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PH15) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PI00) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	((gpio == PI02) && (timer_nr ==  8) && (channel_nr ==  4)) ?  3 : \
	((gpio == PI05) && (timer_nr ==  8) && (channel_nr ==  1)) ?  3 : \
	((gpio == PI06) && (timer_nr ==  8) && (channel_nr ==  2)) ?  3 : \
	((gpio == PI07) && (timer_nr ==  8) && (channel_nr ==  3)) ?  3 : \
	((gpio == PJ06) && (timer_nr ==  8) && (channel_nr ==  2)) ?  3 : \
	((gpio == PJ07) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PJ08) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PJ08) && (timer_nr ==  8) && (channel_nr ==  1)) ?  3 : \
	((gpio == PJ09) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PJ09) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PJ10) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PJ10) && (timer_nr ==  8) && (channel_nr ==  2)) ?  3 : \
	((gpio == PJ11) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PJ11) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PK00) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PK00) && (timer_nr ==  8) && (channel_nr ==  3)) ?  3 : \
	((gpio == PK01) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PK01) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	AF_NO_SUCH_PINFUNC)
#endif
